app/controllers/comments_controller.rb

    def show
        comment = Comment.find_by(id: params[:id])
---
SELECT "comments".* FROM "comments" WHERE "comments"."id" = $1 LIMIT $2  [["id", nil], ["LIMIT", 1]]

    def create

        @comment = @strategy.comments.build(comment_params)


        if @comment.save
---
INSERT INTO "comments" ("title", "created_at", "updated_at", "body", "strategy_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "WORKS SOMTIMES"], ["created_at", "2022-01-24 03:56:35.672073"], ["updated_at", "2022-01-24 03:56:35.672073"], ["body", "SOMETIMES"], ["strategy_id", 1]]

    def set_comment
        @comment = @strategy.comments.find(params[:id])
---
SELECT "comments".* FROM "comments" WHERE "comments"."strategy_id" = $1 AND "comments"."id" = $2 LIMIT $3  [["strategy_id", 1], ["id", 4], ["LIMIT", 1]]

    def get_strategy
        @strategy = Strategy.find(params[:strategy_id])
---
SELECT "strategies".* FROM "strategies" WHERE "strategies"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]