app/controllers/strategies_controller.rb

SELECT "strategies".* FROM "strategies"
---
    def index
        strategies = Strategy.all

SELECT "strategies".* FROM "strategies" WHERE "strategies"."id" = $1 LIMIT $2  [["id", 13], ["LIMIT", 1]]
---
    def show
        strategy = Strategy.find_by(id: params[:id])

INSERT INTO "strategies" ("name", "category", "tier", "description", "reference", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
---
    def create
        @strategy = Strategy.new(strategy_params)
        if @strategy.save

SELECT "strategies".* FROM "strategies" WHERE "strategies"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "strategies" SET "category" = $1, "tier" = $2, "updated_at" = $3 WHERE "strategies"."id" = $4  [["category", "Social"], ["tier", 3], ["updated_at", "2022-01-18 00:02:43.494980"], ["id", 14]]
---
    def update
        @strategy = Strategy.find_by(id: params[:id])
        if @strategy.update(strategy_params)

DELETE FROM "strategies" WHERE "strategies"."id" = $1  [["id", 4]]
---
    def destroy
        @strategy.destroy

SELECT "strategies".* FROM "strategies" WHERE "strategies"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
---
    def set_strategy
        @strategy = Strategy.find_by(id: params[:id])